{
    "GENERAL": {
        "MAIN": {
            "NAME": "Ντενίς Καραντάσεβ",
            "PROFESSION": "Προγραμματιστής Λογισμικού / Προγραμματιστής Προσθήκης",
            "CONTACTS": {
                "EMAIL": "denis.karandashev@gmail.com",
                "PHONE": "306893225172",
                "ADDRESS": "Θεσσαλονίκη, Ελλάδα"
            }
        },
        "SECTION": {
            "SUMMARY": {
                "TITLE": "Σχετικά με μένα",
                "TAB": {
                    "0": {
                        "LABEL": "Επαφή",
                        "SUB_LABEL_1": "Μπορείτε να επικοινωνήσετε μαζί μου με τους παρακάτω τρόπους:",
                        "SUB_LABEL_2": "Κοινωνικά δίκτυα"
                    },
                    "1": {
                        "LABEL": "Σύνοψη",
                        "TEXT": "<p>Εργαζόμενος με προσανατολισμό στη λεπτομέρεια και οργανωμένος, που εργάζεται με γρήγορο ρυθμό για να πληροί σφιχτές προθεσμίες και να συμβάλλει στην επιτυχία της εταιρείας.</p><p>Ξεκίνησε την καριέρα του στην προγραμματισμό το 2020 στη Deutsche Telekom, όπου η απασχόληση συνεχίζεται έως σήμερα. Αρχικά ασχολήθηκε κυρίως με την ανάπτυξη πίσω από το σκηνικό, αλλά σταδιακά οι ενδιαφέροντα μετακινήθηκαν προς την ανάπτυξη μπροστά.</p><p>Πολίτης της Ρωσίας με άδεια διαμονής στην Ελλάδα. Σκέφτεται μετεγκατάσταση στον Καναδά.</p>"
                    },
                    "2": {
                        "LABEL": "Βιογραφικό",
                        "TEXT": "<p>Γεννήθηκα και μεγάλωσα στη Ρωσία, αλλά από το 2022 ζω στην Ελλάδα. Διαθέτω ρωσική υπηκοότητα, καθώς και άδεια διαμονής και εργασίας στην Ελλάδα.</p><p>Απέκτησα πτυχία δικαίου βακαλάβρου και μεταπτυχιακού επιπέδου. Ξεκίνησα την επαγγελματική μου καριέρα ως δικηγόρος, κατέχοντας διάφορες θέσεις, όπως κύριος νομικός σύμβουλος, κύριος νομικός υπάλληλος, αναπληρωτής επικεφαλής του νομικού τμήματος, και ασχολήθηκα επίσης με ιδιωτική πρακτική.</p><p>Το 2020 υποβλήθηκα σε επανακατάρτιση και ξεκίνησα να εργάζομαι ως προγραμματιστής σε εταιρίες υπό το εμπορικό σήμα της Deutsche Telekom.</p>"
                    }
                }
            },
            "SKILLS": {
                "TITLE": "Δεξιότητες",
                "SOFT_LABEL": "Μαλακές δεξιότητες",
                "HARD_LABEL": "Τεχνικές δεξιότητες",
                "ADDITIONAL": " * Οι προεπιλεγμένες δεξιότητες φαίνεται να είναι οι πιο σημαντικές για εμένα.",
                "BE_LABEL": "Πίσω",
                "FE_LABEL": "Μπροστά",
                "TOOLS_LABEL": "Εργαλεία και υπηρεσίες",
                "SOFT_HTML": "<p><b>Επιμονή και Συνεχές Μάθημα:</b> Πάντα προσπαθώ για την αυτοβελτίωση και την εκμάθηση νέων τεχνολογιών για να παραμείνω ενημερωμένος για τις τελευταίες τάσεις στον κόσμο της προγραμματισμού. Η αφοσίωσή μου στη συνεχή μάθηση με επιτρέπει να λύνω αποτελεσματικά τις εργασίες και να κάνω πολύτιμες συνεισφορές στα έργα.</p><p><b>Ακρίβεια και Προσοχή στη Λεπτομέρεια:</b> Διαθέτω αιχμηρή προσοχή στη λεπτομέρεια, που με επιτρέπει να γράφω καθαρό και αποδοτικό κώδικα χωρίς να κάνω λάθη. Η ακρίβειά μου βοηθά να εξασφαλίζεται υψηλή ποιότητα λογισμικού και να ελαχιστοποιούνται τα πιθανά προβλήματα κατά τη διάρκεια της ανάπτυξης.</p><p><b>Ανεξαρτησία και Ευθύνη:</b> Χάρη στην ανεξαρτησία και την ευθύνη μου, είμαι ικανός να εργάζομαι αποτελεσματικά σε έργα τόσο ανεξάρτητα όσο καιμέρος μιας ομάδας. Το κίνητρό μου για αυτοβελτίωση μου επιτρέπει να προσαρμόζομαι γρήγορα σε νέες εργασίες και απαιτήσεις έργων.</p><p><b>Αποτελεσματική Επίλυση Προβλημάτων:</b> Διαθέτω ισχυρές αναλυτικές και δεξιότητες επίλυσης προβλημάτων, που μου επιτρέπουν να βρίσκω γρήγορα και αποτελεσματικά βέλτιστες λύσεις ακόμη και στις πιο προκλητικές καταστάσεις. Η ικανότητά μου να μαθαίνω ανεξάρτητα νέες τεχνολογίες μου επιτρέπει να προσαρμόζομαι γρήγορα σε νέες εργασίες και απαιτήσεις έργων.</p><p><b>Αποτελεσματική Διαχείριση Χρόνου:</b> Διαθέτω δεξιότητες στη διαχείριση του χρόνου μου, που μου επιτρέπουν να οργανώνω τη δουλειά μου αποτελεσματικά και να πληρούμαι τις προθεσμίες. Η ικανότητά μου να σχεδιάζω και να διατάσσω τις εργασίες μου αποτελεσματικά με βοηθά να είμαι παραγωγικός και να επιτυγχάνω υψηλά αποτελέσματα στη δουλειά μου.</p><p><b>Γλώσσες:</b> Ρωσικά (Μητρική), Αγγλικά (Β2), Γαλλικά (Α1).</p>"
            },
            "WORK_HISTORY": {
                "TITLE": "Ιστορικό Εργασίας",
                "PROJECT_NAME_LABEL": "Όνομα Έργου",
                "MAIN_DUTIES_LABEL": "Κύριες Καθήκοντα",
                "MAIN_TECH_LABEL": "Βασικές Τεχνολογίες",
                "FE_LABEL": "Μπροστά",
                "BE_LABEL": "Πίσω",
                "PROJECTS": {
                    "1": {
                        "POSITION": "Προγραμματιστής Java (σταδιοδρομία)",
                        "COMPANY": "EPAM Systems",
                        "LOCATION": "Αγία Πετρούπολη, Ρωσία",
                        "PERIOD_START": "Μάρτιος 2020",
                        "PERIOD_END": "Σεπτέμβριος 2020",
                        "ADDITIONAL": "μερική απασχόληση, απλήρωτη εργασία",
                        "PROJECT": {
                            "NAME": "Κέντρο εκπαίδευσης EPAM",
                            "DESCRIPTION": "Εργασία σε εσωτερικά έργα."
                        },
                        "MAIN_DUTIES": {
                            "1": "Δημιουργία εφαρμογής ταμείου σημειώσεων από το μηδέν.",
                            "2": "Ανάπτυξη έργου για ενοικίαση θέσεων στάθμευσης από το μηδέν."
                        },
                        "MAIN_TECH": {
                            "FE": "Freemarker, Thymeleaf, Bootstrap, Materialize.",
                            "BE": "Java 7, Spring MVC, MySQL, PostgreSQL."
                        }
                    },
                    "2": {
                        "POSITION": "Νεαρός Προγραμματιστής Λογισμικού",
                        "COMPANY": "Deutsche Telekom IT RUS",
                        "LOCATION": "Αγία Πετρούπολη, Ρωσία",
                        "PERIOD_START": "Σεπτέμβριος 2020",
                        "PERIOD_END": "Μάρτιος 2021",
                        "ADDITIONAL": "πλήρης απασχόληση, πληρωμένη εργασία",
                        "PROJECT": {
                            "NAME": "T-Vacations, T-Plan",
                            "DESCRIPTION": "Το T-Vacations βοηθά τους υπαλλήλους της εταιρείας στην επικοινωνία με το τμήμα ανθρώπινων πόρων και τους διευθυντές σε θέματα που αφορούν τις άδειες, την πληρωμή για δραστηριότητες στον τομέα του αθλητισμού, καθώς και τη διατήρηση των χρονοδιαγραμμάτων, των ειδοποιήσεων και των υπενθυμίσεων για τους υπεύθυνους υπαλλήλους. Σκοπός του T-Plan είναι η βελτίωση της αποτελεσματικότητας της εργασίας με προβλέψεις και αναφορές οικονομικών στοιχείων στην T-Systems RUS."
                        },
                        "MAIN_DUTIES": {
                            "1": "Ανάπτυξη νέων/ανασυγγραφή υπαρχόντων χαρακτηριστικών (υπηρεσίες ιστού) στο backend και στο frontend."
                        },
                        "MAIN_TECH": {
                            "FE": "JavaScript, HTML, CSS, Thymeleaf (T-Vacations), React (T-Plan).",
                            "BE": "Java 8, Spring Boot, PostgreSQL 11."
                        }
                    },
                    "3": {
                        "POSITION": "Μηχανικός Λογισμικού (Μπροστά / Full stack)",
                        "COMPANY": "T-Systems Rus",
                        "LOCATION": "Αγία Πετρούπολη, Ρωσία",
                        "PERIOD_START": "Μάρτιος 2021",
                        "PERIOD_END": "Δεκέμβριος 2022",
                        "ADDITIONAL": "πλήρης απασχόληση, πληρωμένη εργασία",
                        "PROJECT": {
                            "NAME": "UIS",
                            "DESCRIPTION": "Ανάπτυξη του UIS (Umwelt-Informations-System, ή Περιβαλλοντικό Σύστημα Πληροφοριών). Το UIS είναι ένα σύστημα για την καταγραφή περιβαλλοντικών πληροφοριών για μια γνωστή διεθνή αυτοκινητοβιομηχανία."
                        },
                        "MAIN_DUTIES": {
                            "1": "Συμμετοχή στην ανάπτυξη λύσεων για την υλοποίηση πολύπλοκης επιχειρησιακής λογικής εντός της εφαρμογής και των συστατικών της (όπως πολυεπίπεδα ερωτηματολόγια, αναφορές, διαχείριση τους σε διάφορα επίπεδα, και διαχείριση αυτών των διαδικασιών).",
                            "2": "Ανάπτυξη διεπαφών χρήστη (από την ανάπτυξη σχεδίου έως την υλοποίηση).",
                            "3": "Συμμετοχή στην ανάπτυξη του backend (εγγραφή των απαραίτητων σημείων ενδιαφέροντος, λογική των υπηρεσιών, ερωτήματα βάσης δεδομένων, δημιουργία ή επεξεργασία οντοτήτων, μεταναστεύσεις βάσεων δεδομένων).",
                            "4": "Γράψιμο εργασιών στο Jira, γράψιμο τεκμηρίωσης στο Confluence."
                        },
                        "MAIN_TECH": {
                            "FE": "Angular 9-13 (HTML, CSS,, TypeScript), PrimeNG, Angular Material.",
                            "BE": "Spring, Java 11, Oracle DB."
                        }
                    },
                    "4": {
                        "POSITION": "Μηχανικός Λογισμικού (Μπροστά / Full stack)",
                        "COMPANY": "Deutsche Telekom Cloud Services",
                        "LOCATION": "Θεσσαλονίκη, Ελλάδα",
                        "PERIOD_START": "Ιανουάριος 2023",
                        "PERIOD_END": "Παρόν",
                        "ADDITIONAL": "πλήρης απασχόληση, πληρωμένη εργασία",
                        "PROJECT": {
                            "NAME": "AFAB",
                            "DESCRIPTION": "Το AFAB (Εφαρμογές για την αυτοκινητοβιομηχανία), ο πελάτης είναι μια διεθνής αυτοκινητοβιομηχανία. Αυτές οι εφαρμογές παρέχουν διαχείριση παραγγελιών για εμπορικά οχήματα, χρησιμοποιούνται σε όλα τα μέρη του κόσμου όπου μπορούν να παραγγείλουν φορτηγά και λεωφορεία αυτής της εταιρείας."
                        },
                        "MAIN_DUTIES": {
                            "1": "Ανάπτυξη πολύπλοκων πολυεπίπεδων διεπαφών χρήστη για τη δημιουργία, τροποποίηση και διαχείριση παραγγελιών.",
                            "2": "Τροποποίηση υπαρχουσών διεπαφών σύμφωνα με τις απαιτήσεις του πελάτη.",
                            "3": "Διόρθωση σφαλμάτων, συνεργασία με τους δοκιμαστές και άλλους προγραμματιστές.",
                            "4": "Βοήθεια σε νέους προγραμματιστές (αναθεώρηση κώδικα, βοήθεια στην επίλυση προβλημάτων)."
                        },
                        "MAIN_TECH": {
                            "FE": "Angular 13, TypeScript, CSS, HTML",
                            "BE": "Java 17"
                        }
                    }
                }
            },
            "PREVIOUS_EMPLOYMENT": {
                "TITLE": "Προηγούμενες Εργασίες"
            },
            "EDUCATION": {
                "TITLE": "Εκπαίδευση",
                "COURSES": {
                    "0": {
                        "TITLE": "HTML, CSS, και Javascript για Προγραμματιστές Ιστού",
                        "INST": "Πανεπιστήμιο Johns Hopkins"
                    },
                    "1": {
                        "TITLE": "Ανάγκες Πελατών και Απαιτήσεις Λογισμικού",
                        "INST": "Πανεπιστήμιο Alberta"
                    },
                    "2": {
                        "TITLE": "Βασικά React",
                        "INST": "Meta"
                    },
                    "3": {
                        "TITLE": "Προχωρημένο React",
                        "INST": "Meta"
                    },
                    "4": {
                        "TITLE": "Αρχές Σχεδιασμού UX/UI",
                        "INST": "Meta"
                    },
                    "5": {
                        "TITLE": "Angular 2023Q4",
                        "INST": "Σχολή RS"
                    },
                    "6": {
                        "TITLE": "Βασικά ανάπτυξης ιστού",
                        "INST": "Πανεπιστήμιο Κούρσκ"
                    },
                    "7": {
                        "TITLE": "Σύγχρονες τεχνολογίες για την ανάπτυξη και το σχεδιασμό γραφικών εφαρμογών",
                        "INST": "Πανεπιστήμιο Ιαροσλάβλ"
                    },
                    "8": {
                        "TITLE": "Πρόγραμμα Προγραμματιστή Java",
                        "INST": "GeekBrains"
                    },
                    "9": {
                        "TITLE": "Μεταπτυχιακό Δίπλωμα στο Εμπορικό Δίκαιο",
                        "INST": "Πανεπιστήμιο Αγίας Πετρούπολης"
                    }
                }
            },
            "LANGUAGES": {
                "TITLE": "Γλώσσες"
            }
        }
    },
    "BTN": {
        "DOWNLOAD": "ΛΗΨΗ"
    },
    "SNACK_BAR": {
        "COPY": "Αντιγράφηκε στο πρόχειρο",
        "CLOSE": "Κλείσιμο"
    }
}