{
    "GENERAL": {
        "MAIN": {
            "NAME": "Денис Карандашев",
            "PROFESSION": "Программист / Фронтенд-разработчик",
            "CONTACTS": {
                "EMAIL": "denis.karandashev@gmail.com",
                "PHONE": "306893225172",
                "ADDRESS": "Салоники, Греция"
            }
        },
        "SECTION": {
            "SUMMARY": {
                "TITLE": "Обо мне",
                "TAB": {
                    "0": {
                        "LABEL": "Контакты",
                        "SUB_LABEL_1": "Со мной можно связаться следующими способами:",
                        "SUB_LABEL_2": "Социальные сети"
                    },
                    "1": {
                        "LABEL": "Основное",
                        "TEXT":"<p>Начал карьеру в программировании в 2020 году в Deutsche Telekom, где работаю по сей день. В начале в основном занимался разработкой бэкенда, интересы постепенно переключились во фронтенд-разработку.</p><p>Гражданин России с видом на жительство в Греции. Планирую переезд в Канаду.</p>" },
                    "2": {
                        "LABEL": "Биография",
                        "TEXT": "<p>Родился и вырос в России, но с 2022 года проживаю в Греции. Имею гражданство России, а также вид на жительство и разрешение на работу в Греции.</p><p>Я получил степень бакалавра и магистра в области юриспруденции. Начал свою профессиональную карьеру в качестве юриста, занимая различные должности, такие как ведущий юридический консультант, главный юрист, заместитель начальника юридического отдела, а также занимался частной практикой.</p><p>В 2020 году я прошел переобучение и начал работать программистом в компаниях под брендом Deutsche Telekom.</p>"
                    }
                }
            },
            "SKILLS": {
                "TITLE": "Навыки",
                "SOFT_LABEL": "Нетехнические навыки",
                "HARD_LABEL": "Технические навыки",
                "ADDITIONAL": " * Выбранные навыки кажутся мне наиболее важными.",
                "BE_LABEL": "Бэкенд",
                "FE_LABEL": "Фронтенд",
                "TOOLS_LABEL": "Инструменты и сервисы",
                "SOFT_HTML": "<p><b>Упорство и постоянное обучение:</b> Я постоянно стремлюсь к самосовершенствованию и изучаю новые технологии, чтобы быть в курсе последних тенденций в мире программирования. Мое стремление к постоянному обучению позволяет мне эффективно решать задачи и вносить ценный вклад в проекты.</p><p><b>Точность и внимание к деталям:</b> Я обладаю внимательностью к деталям, что позволяет мне писать чистый и эффективный код без ошибок. Моя точность помогает обеспечить высокое качество программного обеспечения и минимизировать возможные проблемы в процессе разработки.</p><p><b>Самостоятельность и ответственность:</b> Благодаря моей самостоятельности и ответственности я способен эффективно работать над проектами как самостоятельно, так и в команде. Мое стремление к самосовершенствованию позволяет мне быстро адаптироваться к новым задачам и требованиям проектов.</p><p><b>Эффективное решение проблем:</b> Я обладаю сильными аналитическими и навыками решения проблем, что позволяет мне быстро и эффективно находить оптимальные решения, даже в самых сложных ситуациях. Моя способность самостоятельно изучать новые технологии позволяет мне быстро адаптироваться к новым задачам и требованиям проектов.</p><p><b>Эффективное управление временем:</b> Я умею эффективно управлять своим временем, что позволяет мне организовывать свою работу эффективно и соблюдать сроки. Мое умение планировать и оптимизировать задачи помогает мне быть продуктивным и достигать высоких результатов в работе.</p><p><b>Языки:</b> Русский (родной), Английский (B2), Французский (A1).</p>"
            },
            "WORK_HISTORY": {
                "TITLE": "Профессиональный путь",
                "PROJECT_NAME_LABEL": "Название проекта",
                "MAIN_DUTIES_LABEL": "Основные обязанности",
                "MAIN_TECH_LABEL": "Основные технологии",
                "FE_LABEL": "Фронтенд",
                "BE_LABEL": "Бэкенд",
                "PROJECTS": {
                    "1": {
                        "POSITION": "Java-разработчик (стажировка)",
                        "COMPANY": "EPAM Systems",
                        "LOCATION": "Санкт-Петербург, Россия",
                        "PERIOD_START": "Март 2020",
                        "PERIOD_END": "Сентябрь 2020",
                        "ADDITIONAL": "частичная занятость, неоплачиваемая работа",
                        "PROJECT": {
                            "NAME": "Учебный центр EPAM",
                            "DESCRIPTION": "Работа над внутренними проектами."
                        },
                        "MAIN_DUTIES": {
                            "1": "Создание веб-приложения для ведения записей.",
                            "2": "Разработка проекта по аренде парковочных мест."
                        },
                        "MAIN_TECH": {
                            "FE": "Freemarker, Thymeleaf, Bootstrap, Materialize.",
                            "BE": "Java 7, Spring MVC, MySQL, PostgreSQL."
                        }
                    },
                    "2": {
                        "POSITION": "Младший инженер-программист",
                        "COMPANY": "Deutsche Telekom IT RUS",
                        "LOCATION": "Санкт-Петербург, Россия",
                        "PERIOD_START": "Сентябрь 2020",
                        "PERIOD_END": "Март 2021",
                        "ADDITIONAL": "полная занятость, оплачиваемая работа",
                        "PROJECT": {
                            "NAME": "T-Vacations, T-Plan",
                            "DESCRIPTION": "T-Vacations помогает сотрудникам компании в взаимодействии с отделом кадров и руководителями по ряду вопросов, связанных с отпусками, оплатой спортивных мероприятий, а также ведением табелей учета рабочего времени, уведомлений и напоминаний для ответственных сотрудников. Цель T-Plan - повышение эффективности работы с финансовыми прогнозами и отчетами в T-Systems RUS."
                        },
                        "MAIN_DUTIES": {
                            "1": "Разработка новых/переработка существующих функций (веб-сервисы) на backend и frontend."
                        },
                        "MAIN_TECH": {
                            "FE": "JavaScript, HTML, CSS, Thymeleaf (T-Vacations), React (T-Plan).",
                            "BE": "Java 8, Spring Boot, PostgreSQL 11."
                        }
                    },
                    "3": {
                        "POSITION": "Инженер-прораммист (Фронтенд / Фуллстек)",
                        "COMPANY": "T-Systems Rus",
                        "LOCATION": "Санкт-Петербург, Россия",
                        "PERIOD_START": "Март 2021",
                        "PERIOD_END": "Декабрь 2022",
                        "ADDITIONAL": "полная занятость, оплачиваемая работа",
                        "PROJECT": {
                            "NAME": "UIS",
                            "DESCRIPTION": "Разработка UIS (Umwelt-Informations-System). UIS - это система для записи информации об окружающей среде для известного международного автомобильного концерна."
                        },
                        "MAIN_DUTIES": {
                            "1": "Участие в разработке решений для реализации сложной бизнес-логики в приложении и его компонентах (таких как многоуровневые анкеты, отчеты, управление ими на разных уровнях и администрирование этих процессов).",
                            "2": "Разработка пользовательских интерфейсов (от разработки дизайна до внедрения).",
                            "3": "Участие в разработке backend (написание необходимых конечных точек, логики сервиса, запросов к базе данных, создание или редактирование сущностей, миграции баз данных).",
                            "4": "Формулирование задач в Jira, написание документации в Confluence."
                        },
                        "MAIN_TECH": {
                            "FE": "Angular 9-13 (HTML, CSS,, Typescript), PrimeNG, Angular Material.",
                            "BE": "Spring, Java 11, Oracle DB."
                        }
                    },
                    "4": {
                        "POSITION": "Инженер-прораммист (Фронтенд / Фуллстек)",
                        "COMPANY": "Deutsche Telekom Cloud Services",
                        "LOCATION": "Салоники, Греция",
                        "PERIOD_START": "Январь 2023",
                        "PERIOD_END": "По настоящее время",
                        "ADDITIONAL": "полная занятость, оплачиваемая работа",
                        "PROJECT": {
                            "NAME": "AFAB",
                            "DESCRIPTION": "AFAB (Приложения для автомобильного бизнеса), заказчик - международный автомобильный концерн. Эти приложения обеспечивают управление заказами на коммерческие транспортные средства, используемые во всех частях мира, где можно заказать грузовики и автобусы этого концерна."
                        },
                        "MAIN_DUTIES": {
                            "1": "Разработка сложных многоуровневых пользовательских интерфейсов для создания, изменения и управления заказами.",
                            "2": "Изменение существующих интерфейсов в соответствии с требованиями заказчика.",
                            "3": "Исправление ошибок, тесное взаимодействие с тестировщиками и другими разработчиками.",
                            "4": "Помощь начинающим разработчикам (код-ревью, помощь в решении сложных задач)."
                        },
                        "MAIN_TECH": {
                            "FE": "Angular 13, TypeScript, CSS, HTML",
                            "BE": "Java 17"
                        }
                    }
                }
            },
            "PREVIOUS_EMPLOYMENT": {
                "TITLE": "Предыдущая работа"
            },
            "EDUCATION": {
                "TITLE": "Образование",
                "COURSES": {
                    "0": {
                        "TITLE": "HTML, CSS и JavaScript для веб-разработчиков",
                        "INST": "Университет Джона Хопкинса, США"
                    },
                    "1": {
                        "TITLE": "Потребности клиента и требования к программному обеспечению",
                        "INST": "Университет Альберты, Канада"
                    },
                    "2": {
                        "TITLE": "Основы React",
                        "INST": "Meta"
                    },
                    "3": {
                        "TITLE": "Продвинутый React",
                        "INST": "Meta"
                    },
                    "4": {
                        "TITLE": "Принципы UX/UI-дизайна",
                        "INST": "Meta"
                    },
                    "5": {
                        "TITLE": "Angular 2023Q4",
                        "INST": "RS School"
                    },
                    "6": {
                        "TITLE": "Основы веб-разработки",
                        "INST": "Курский государственный университет"
                    },
                    "7": {
                        "TITLE": "Современные технологии для разработки и проектирования графических приложений",
                        "INST": "Ярославский государственный университет"
                    },
                    "8": {
                        "TITLE": "Профессия Java-разработчик",
                        "INST": "GeekBrains"
                    },
                    "9": {
                        "TITLE": "Магистр коммерческого права",
                        "INST": "Санкт-Петербургский государственный университет"
                    }
                }
            },
            "LANGUAGES": {
                "TITLE": "Языки"
            }
        }
    },
    "BTN": {
        "DOWNLOAD": "ЗАГРУЗИТЬ"
    },
    "SNACK_BAR": {
        "COPY": "Скопировано в буфер обмена",
        "CLOSE": "Закрыть"
    }
}